commenter_shortcuts = {
        "משנה ברורה": "מב",
        "פתחי תשובה": "פת",
        "באר היטב": "בהט",
        "מגן אברהם": "מא",
        "ביאור הלכה": "בהל",
        "טורי זהב": "טז",
        "ט\"ז": "טז",
        "כף החיים": "כהח",
        "באר הגולה": "בהג",
        "פרי מגדים": "פרמג"
        }

commenter_page_format = {
        "default": "{commenter} על {section}",
        "שערי תשובה": "שערי תשובה (מרגליות)/{\" \".join(section.split()[:-1])}/{section.split()[-1]}",
        "כף החיים": "כף החיים/{\" \".join(section.split()[:-1])}/{section.split()[-1]}",
        "באר הגולה": "באר הגולה (רבקש) על {section}"
        }

heading_formats = {
        "משנה ברורה":  "(.*) (וכו')?",
        "מגן אברהם": "(.*)",
        "ביאור הלכה": "(.*)(וכו')?:"
        }
